concentration_game/perf_test.yml
config:
  target: "https://cs-455-assignment-1.vercel.app"
  phases:
    - duration: 60
      arrivalRate: 100
      rampTo: 10000
      name: 100 load
    - duration: 60
      arrivalRate: 1000
      rampTo: 10000
      name: 1000 load
    - duration: 60
      arrivalRate: 2000
      rampTo: 10000
      name: 2000 load
    - duration: 60
      arrivalRate: 5000
      rampTo: 10000
      name: 5000 load
    - duration: 60
      arrivalRate: 10000
      rampTo: 10000
      name: 10000 load
  http:
    timeout: 60

scenarios:
  - name: "Simple game access"
    flow:
      - post:
          url: "/api/auth"
          headers:
            Content-Type: "application/json"
          json:
            username: "123"
            password: "123"
      - think: 1
      - get:
          url: "/game"