concentration_game/perf_test.yml
config:
  target: "https://cs-455-assignment-1.vercel.app"
  phases:
    - duration: 10
      arrivalRate: 10000
      rampTo: 100000
  http:
    timeout: 60

scenarios:
  - name: "Simple game access"
    flow:
      - post:
          url: "/api/auth"
          headers:
            Content-Type: "application/json"
          json:
            username: "123"
            password: "123"
      - think: 1
      - get:
          url: "/game"